7767517
93 103
Input            input_1                  0 1 input_1
Convolution      Conv_0                   1 1 input_1 242 0=32 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=864
Clip             Clip_2                   1 1 242 244 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_3                   1 1 244 245 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=288 7=32
Clip             Clip_5                   1 1 245 247 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_6                   1 1 247 248 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=512
Convolution      Conv_8                   1 1 248 250 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1536
Clip             Clip_10                  1 1 250 252 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_11                  1 1 252 253 0=96 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=864 7=96
Clip             Clip_13                  1 1 253 255 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_14                  1 1 255 256 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
Split            splitncnn_0              1 2 256 256_splitncnn_0 256_splitncnn_1
Convolution      Conv_16                  1 1 256_splitncnn_1 258 0=144 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3456
Clip             Clip_18                  1 1 258 260 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_19                  1 1 260 261 0=144 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1296 7=144
Clip             Clip_21                  1 1 261 263 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_22                  1 1 263 264 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3456
BinaryOp         Add_24                   2 1 264 256_splitncnn_0 266 0=0
Split            splitncnn_1              1 2 266 266_splitncnn_0 266_splitncnn_1
Convolution      Conv_25                  1 1 266_splitncnn_1 267 0=144 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3456
Clip             Clip_27                  1 1 267 269 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_28                  1 1 269 270 0=144 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=1296 7=144
Clip             Clip_30                  1 1 270 272 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_31                  1 1 272 273 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4608
Split            splitncnn_2              1 2 273 273_splitncnn_0 273_splitncnn_1
Convolution      Conv_33                  1 1 273_splitncnn_1 275 0=192 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=6144
Clip             Clip_35                  1 1 275 277 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_36                  1 1 277 278 0=192 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1728 7=192
Clip             Clip_38                  1 1 278 280 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_39                  1 1 280 281 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=6144
BinaryOp         Add_41                   2 1 281 273_splitncnn_0 283 0=0
Split            splitncnn_3              1 2 283 283_splitncnn_0 283_splitncnn_1
Convolution      Conv_42                  1 1 283_splitncnn_1 284 0=192 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=6144
Clip             Clip_44                  1 1 284 286 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_45                  1 1 286 287 0=192 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1728 7=192
Clip             Clip_47                  1 1 287 289 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_48                  1 1 289 290 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=6144
BinaryOp         Add_50                   2 1 290 283_splitncnn_0 292 0=0
Split            splitncnn_4              1 2 292 292_splitncnn_0 292_splitncnn_1
Convolution      Conv_51                  1 1 292_splitncnn_1 293 0=192 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=6144
Clip             Clip_53                  1 1 293 295 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_54                  1 1 295 296 0=192 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=1728 7=192
Clip             Clip_56                  1 1 296 298 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_57                  1 1 298 299 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=12288
Split            splitncnn_5              1 2 299 299_splitncnn_0 299_splitncnn_1
Convolution      Conv_59                  1 1 299_splitncnn_1 301 0=384 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=24576
Clip             Clip_61                  1 1 301 303 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_62                  1 1 303 304 0=384 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=3456 7=384
Clip             Clip_64                  1 1 304 306 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_65                  1 1 306 307 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=24576
BinaryOp         Add_67                   2 1 307 299_splitncnn_0 309 0=0
Split            splitncnn_6              1 2 309 309_splitncnn_0 309_splitncnn_1
Convolution      Conv_68                  1 1 309_splitncnn_1 310 0=384 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=24576
Clip             Clip_70                  1 1 310 312 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_71                  1 1 312 313 0=384 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=3456 7=384
Clip             Clip_73                  1 1 313 315 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_74                  1 1 315 316 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=24576
BinaryOp         Add_76                   2 1 316 309_splitncnn_0 318 0=0
Split            splitncnn_7              1 2 318 318_splitncnn_0 318_splitncnn_1
Convolution      Conv_77                  1 1 318_splitncnn_1 319 0=384 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=24576
Clip             Clip_79                  1 1 319 321 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_80                  1 1 321 322 0=384 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=3456 7=384
Clip             Clip_82                  1 1 322 324 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_83                  1 1 324 325 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=24576
BinaryOp         Add_85                   2 1 325 318_splitncnn_0 327 0=0
Convolution      Conv_86                  1 1 327 328 0=384 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=24576
Clip             Clip_88                  1 1 328 330 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_89                  1 1 330 331 0=384 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=3456 7=384
Clip             Clip_91                  1 1 331 333 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_92                  1 1 333 334 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=36864
Split            splitncnn_8              1 2 334 334_splitncnn_0 334_splitncnn_1
Convolution      Conv_94                  1 1 334_splitncnn_1 336 0=576 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=55296
Clip             Clip_96                  1 1 336 338 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_97                  1 1 338 339 0=576 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=5184 7=576
Clip             Clip_99                  1 1 339 341 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_100                 1 1 341 342 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=55296
BinaryOp         Add_102                  2 1 342 334_splitncnn_0 344 0=0
Split            splitncnn_9              1 2 344 344_splitncnn_0 344_splitncnn_1
Convolution      Conv_103                 1 1 344_splitncnn_1 345 0=576 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=55296
Clip             Clip_105                 1 1 345 347 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_106                 1 1 347 348 0=576 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=5184 7=576
Clip             Clip_108                 1 1 348 350 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_109                 1 1 350 351 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=55296
BinaryOp         Add_111                  2 1 351 344_splitncnn_0 353 0=0
Interp           Upsample_128             1 1 266_splitncnn_0 370 0=2 1=1.000000e+00 2=1.000000e+00 6=0
Interp           Upsample_139             1 1 292_splitncnn_0 381 0=2 1=2.000000e+00 2=2.000000e+00 6=0
Interp           Upsample_150             1 1 353 392 0=2 1=4.000000e+00 2=4.000000e+00 6=0
Concat           Concat_151               3 1 370 381 392 393 0=0
Convolution      Conv_161                 1 1 393 403 0=152 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=23104
ReLU             Relu_163                 1 1 403 405
Convolution      Conv_164                 1 1 405 406 0=212 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=32224
Reshape          Reshape_169              1 1 406 415 0=4096 1=-1 2=2
Reshape          Reshape_191              1 1 415 output_1 0=64 1=64 2=212
